"""
a = [{'a':'b','c':'d','e':'f'},{'g':'h','i':'j','k':'m'}]
print(a[1]['k'])

普通的年份，能整除4， 就是闰年，但是，对于整百的年份，例如1900， 2000， 2100,要整除400才行
mlist = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
y1 = int(input("请输入年份："))
m1 = int(input("请输入月份："))
m_1 = m1-1
if y1%4 == 0 and y1%100!=0 or y1%400 == 0:
    print("是闰年，修改2月的天数")
    mlist[1] = 29
#
# # 格式化输出，%d是占位符，代表这里有一个整数，第一个参数是一个模板字符串
# # % 是分隔符，把模板字符串和实际的数值分隔开，%右边，是一组实际的值，替换掉
# # 模板字符串中的占位符
print("{}年{}月有{}天".format (y1, m1, mlist[m_1]))

a = [[31,28,31,30,31,30,31,31,30,31,30,31],[31,29,31,30,31,30,31,31,30,31,30,31]]
year = int(input('请输入年份'))
month = int(input('请输入月份'))
m = month -1
if year%4 == 0 and year%100!=0 or year%400 == 0:
    i = 1
else:
    i = 0
print('{}年{}月有{}天'.format(year,month,a[i][m]))
"""
